-- from revision 330
CREATE TABLE `browser_info` (
  `id` bigint(20) NOT NULL auto_increment,
  `version` bigint(20) NOT NULL,
  `info` varchar(255) default NULL,
  PRIMARY KEY  (`id`)
);
ALTER TABLE genre
  ADD COLUMN `title` varchar(255) collate utf8_unicode_ci NOT NULL AFTER name;
ALTER TABLE manga 
  ADD COLUMN `rating` int(11) NOT NULL AFTER name;
ALTER TABLE visit
  ADD COLUMN`browser_info_id` bigint(20) NOT NULL AFTER id,
  ADD KEY `FK6B04D4B8A9FAC90` (`browser_info_id`);

INSERT INTO `manga_genre` VALUES 
(1,17,0),(1,13,1),(1,19,2),(1,14,3),(2,17,0),(2,14,1),(2,13,2),(3,17,0),(3,19,1),(4,29,0),(4,17,1),(5,4,0),(5,30,1),(6,17,0),(7,5,0),(7,14,1),(7,1,2),(8,17,0),(8,19,1),(8,14,2),(8,8,3),(9,5,0),(9,4,1),(9,19,2),(10,22,0),(10,19,1),(10,14,2),(11,28,0),(12,31,0),(13,17,0),(13,14,1),(13,13,2),(14,17,0),(14,14,1),(14,13,2),(15,5,0),(15,1,1),(16,22,0),(17,5,0),(18,28,0),(19,16,0),(19,8,1),(19,17,2),(19,33,3),(19,32,4),(20,28,0),(21,5,0),(21,19,1),(21,10,2),(22,5,0),(22,19,1),(22,14,2),(22,4,3),(23,5,0),(24,16,0),(24,13,1),(24,17,2),(25,5,0),(25,14,1),(26,28,0),(26,14,1),(26,13,2),(27,22,0),(27,14,1),(28,17,0),(28,8,1),(29,17,0),(29,14,1),(30,5,0),(31,22,0),(31,27,1),(32,5,0),(32,1,1),(33,5,0),(33,19,1),(33,4,2),(33,10,3),(34,5,0),(34,19,1),(34,4,2),(34,1,3),(35,5,0),(35,19,1),(35,4,2),(35,10,3),(36,5,0),(36,4,1),(36,1,2),(37,17,0),(37,14,1),(37,13,2),(38,5,0),(38,19,1),(38,4,2),(38,30,3),(39,31,0),(39,5,1),(40,5,0),(40,19,1),(40,14,2),(40,4,3),(40,30,4),(42,5,0),(42,4,1),(43,5,0),(43,19,1),(43,4,2),(45,5,0),(44,14,0),(44,1,1),(44,21,2),(44,15,3),(44,2,4);

INSERT INTO `genre` VALUES (1,3,'drama','драма'),(2,2,'historical','история'),(3,3,'mature_shoujo','сёдзё для взрослых'),(4,2,'romance','романтика'),(5,2,'shoujo','сёдзё'),(6,2,'yuri','юри'),(7,2,'ecchi','эротика'),(8,2,'horror','ужасы'),(9,2,'mecha','меха'),(10,2,'school','школа'),(11,3,'shoujo_ai','сёдзё-ай'),(12,2,'sports','спорт'),(13,3,'adventure','приключения'),(14,2,'fantasy','фэнтези'),(15,2,'mystery','мистика'),
(16,2,'sci-fi','научная фантастика'),(17,2,'shounen','сёнэн'),(18,2,'natural','повседневность'),(19,2,'comedy','комедия'),(20,2,'codomo','кодомо'),(21,2,'seinen','сэйнэн'),(22,2,'shounen_ai','сёнэн-ай'),(23,2,'fantastic','фантастика'),(24,2,'doujinshi','додзинси'),(25,1,'Harem','Harem'),
(26,1,'Martial Arts','Martial Arts'),(27,1,'Psychological','Psychological'),(28,1,'Yaoi','Yaoi'),(29,1,'Heroic_fantasy','Heroic_fantasy'),(30,1,'Maho-shoujo','Maho-shoujo'),(31,2,'Vampires','Vampires'),(32,1,'erotica','erotica'),(33,2,'thriller','thriller');
